---
kind: property
id: P:Autodesk.Revit.DB.DirectContext3D.Camera.TargetDistance
source: html/117eb5fa-ef4b-cf08-ff5b-d8b0b2abb6be.htm
---
# Autodesk.Revit.DB.DirectContext3D.Camera.TargetDistance Property

Distance from camera to its target

## Syntax (C#)
```csharp
public double TargetDistance { get; set; }
```